test/lbm1Foam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topWall
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1000;
        startFace       999;
    }
    bottomWall
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1000;
        startFace       1999;
    }
    leftAndRight_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1;
        startFace       2999;
        matchTolerance  0.0001;
        neighbourPatch  leftAndRight_half0;
        transformType   translational;
        separation      (10 0 0);
    }
    leftAndRight_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1;
        startFace       3000;
        matchTolerance  0.0001;
        neighbourPatch  leftAndRight_half1;
        transformType   translational;
        separation      (-10 0 0);
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2000;
        startFace       3001;
    }
)

// ************************************************************************* //
